import React from 'react';
import ReactDOM from 'react-dom';
import { BrowserRouter, Route, Link } from "react-router-dom";


 function AppContentArtPreview() {
    
     return (
         <div className='App-content-art-wholly'>
                <article >
                    <h1>Article wholly</h1>
                    <p>
                      Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление однозначно определяет каждого участника как способного принимать собственные решения касаемо системы обучения кадров, соответствующей насущным потребностям. Господа, перспективное планирование обеспечивает широкому кругу (специалистов) участие в формировании инновационных методов управления процессами. Есть над чем задуматься: представители современных социальных резервов призывают нас к новым свершениям, которые, в свою очередь, должны быть подвергнуты целой серии независимых исследований. В целом, конечно, социально-экономическое развитие в значительной степени обусловливает важность стандартных подходов. В своём стремлении улучшить пользовательский опыт мы упускаем, что базовые сценарии поведения пользователей, вне зависимости от их уровня, должны быть объявлены нарушающими общечеловеческие нормы этики и морали. Безусловно, консультация с широким активом требует анализа дальнейших направлений развития.
                  </p>
                <button>Подробнее</button>
                </article>
              </div>

     )


 }
 export default AppContentArtPreview
