let state = { 
    cards: [
        {
            idCard: 1,
            titlle: "Card 1",
            content : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."
        },
        {
            idCard: 2,
            titlle: "Card 2",
            content : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."            
        },
        {
            idCard: 3,
            titlle: "Card 3",
            content : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."
        },
        {
            idCard: 4,
            titlle: "Card 4",
            content : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."            
        },
        {
            idCard: 5,
            titlle: "Card 5",
            content : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."
        },
        {
            idCard: 6,
            titlle: "Card 6",
            content : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."            
        },
        {
            idCard: 7,
            titlle: "Card 7",
            content : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."
        },
        {
            idCard: 8,
            titlle: "Card 8",
            content : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."            
        },
         {
            idCard: 9,
            titlle: "Card 9",
            content : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."            
        }
        

    ],
    banners: [
        
        {
            idBanner: 1,
            hrefBanner: "#",
            srcImg: "https://sozvezdie.edu54.ru/wp-content/uploads/2020/01/CsOi_CXWgAEBqem.jpg-large.jpg",
            altImg: "Пример"       
        },
        {
            idBanner: 2,
            hrefBanner: "#",
            srcImg: "https://kkm-online.ru/tn_300x300__f_cc_ffffff_0/media_catalog_item_129/1571926044/rosobrnadzor.jimg",
            altImg: "Пример"       
        },
        {
            idBanner: 3,
            hrefBanner: "#",
            srcImg: "https://kubsu.ru/sites/default/files/insert/page/mon_logo_0.png",
            altImg: "Пример"       
        },
        {
            idBanner: 4,
            hrefBanner: "#",
            srcImg: "https://kubsu.ru/sites/default/files/insert/page/mon_logo_0.png",
            altImg: "Пример"       
        },
        {
            idBanner: 5,
            hrefBanner: "#",
            srcImg: "https://kubsu.ru/sites/default/files/insert/page/mon_logo_0.png",
            altImg: "Пример"       
        },
        {
            idBanner: 6,
            hrefBanner: "#",
            srcImg: "https://kubsu.ru/sites/default/files/insert/page/mon_logo_0.png",
            altImg: "Пример"       
        }

    ],
    articles:[
        {
            articleId: 1,
            titlle: "Article 1",
            content : "В целом, конечно, базовый вектор развития прекрасно подходит для реализации переосмысления внешнеэкономических политик. Прежде всего, консультация с широким активом влечет за собой процесс внедрения и модернизации благоприятных перспектив. Убеждённость некоторых оппонентов позволяет оценить значение первоочередных требований. В своём стремлении улучшить пользовательский опыт мы упускаем, что непосредственные участники технического прогресса ограничены исключительно образом мышления. Каждый из нас понимает очевидную вещь: перспективное планирование однозначноwertyeryse45uys46u46u8e5ue5n65u75 54y7w467 yw46  определяет каждого участника как способного принимать собственные решения касаемо стандартных подходов. Современные технологии достигли такого уровня, что синтетическое тестирование обеспечивает широкому кругу (специалистов) участие в формировании приоритизации разума над эмоциями."
        }, 
        {
            articleId: 2,
            titlle: "Article 2",
            content : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось.В целом, конечно, базовый вектор развития прекрасно подходит для реализации переосмысления внешнеэкономических политик. Прежде всего, консультация с широким активом влечет за собой процесс "            
        },
        {
            articleId: 3,
            titlle: "Article 3",
            content : "В целом, конечно, базовый вектор развития прекрасно подходит для реализации переосмысления внешнеэкономических политик. Прежде всего, консультация с широким активом влечет за собой процесс внедрения и модернизации благоприятных перспектив. Убеждённость некоторых оппонентов позволяет оценить значение первоочередных требований. В своём стремлении улучшить пользовательский опыт мы упускаем, что непосредственные участники технического прогресса ограничены исключительно образом мышления. Каждый из нас понимает очевидную вещь: перспективное планирование однозначноwertyeryse45uys46u46u8e5ue5n65u75 54y7w467 yw46  определяет каждого участника как способного принимать собственные решения касаемо стандартных подходов. Современные технологии достигли такого уровня, что синтетическое тестирование обеспечивает широкому кругу (специалистов) участие в формировании приоритизации разума над эмоциями."
        },
         {
            articleId: 4,
            titlle: "Article 4",
            content : "В целом, конечно, базовый вектор развития прекрасно подходит для реализации переосмысления внешнеэкономических политик. Прежде всего, консультация с широким активом влечет за собой процесс внедрения и модернизации благоприятных перспектив. Убеждённость некоторых оппонентов позволяет оценить значение первоочередных требований. В своём стремлении улучшить пользовательский опыт мы упускаем, что непосредственные участники технического прогресса ограничены исключительно образом мышления. Каждый из нас понимает очевидную вещь: перспективное планирование однозначноwertyeryse45uys46u46u8e5ue5n65u75 54y7w467 yw46  определяет каждого участника как способного принимать собственные решения касаемо стандартных подходов. Современные технологии достигли такого уровня, что синтетическое тестирование обеспечивает широкому кругу (специалистов) участие в формировании приоритизации разума над эмоциями."
        }
       
    ],
    NavLinks: [
        {
            idNavLink: 1,
            nameNavLink: "Главная",
            hrefNavLink: "/"
                   
        },
        {
            idNavLink: 2,
            nameNavLink: "Статьи",
            hrefNavLink: "/articleContent"
           
                   
        },
        
        {
            idNavLink: 3,
            nameNavLink: "Новости",
            hrefNavLink: "/news"
                   
        },
       
        {
            idNavLink: 5,
            nameNavLink: "Направления работы",
            hrefNavLink: "/works"
                   
        }  
         
    ],
    NavLinksWork: [
        {
            idNavLink: 1,
            nameNavLink: "МОЦ",
            hrefNavLink: "/moz"
                   
        },
        {
            idNavLink: 2,
            nameNavLink: "Постановка на учет в ДОУ",
            hrefNavLink: "/workDou"
           
                   
        },
        
        {
            idNavLink: 3,
            nameNavLink: "Летний отдых",
            hrefNavLink: "/SummerVacation"
                   
        },
       
        {
            idNavLink: 5,
            nameNavLink: "Направления работы",
            hrefNavLink: "/works"
                   
        }  
         
    ],
    contNews: [
        {
            articleNewsId: 1,
            title: "News 1",
            img: "https://i.pinimg.com/564x/22/b8/ae/22b8ae1cdd51a741e701d4f1b2d175fa.jpg",
            content: "Xто непосредственные участники технического прогресса ограничены исключительно образом мышления. Каждый из нас понимает очевидную вещь: перспективное планирование однозначноwertyeryse45uys46u46u8e5ue5n65u75 54y7w467 yw46  определяет каждого участника как способного принимать собственные решения касаемо стандартных подходов. Современные технологии достигли такого уровня, что синтетическое тестирование обеспечивает широкому кругу (специалистов) участие в формировании приоритизации разума над эмоциями."
        },
        {
            articleNewsId: 2,
            title: "News 2",
            img: "https://i.pinimg.com/564x/22/b8/ae/22b8ae1cdd51a741e701d4f1b2d175fa.jpg",
            content: "XXXXXXXXXXто непосредственные участники технического прогресса ограничены исключительно образом мышления. Каждый из нас понимает очевидную вещь: перспективное планирование однозначноwertyeryse45uys46u46u8e5ue5n65u75 54y7w467 yw46  определяет каждого участника как способного принимать собственные решения касаемо стандартных подходов. Современные технологии достигли такого уровня, что синтетическое тестирование обеспечивает широкому кругу (специалистов) участие в формировании приоритизации разума над эмоциями."
        },
        {
            articleNewsId: 3,
            title: "News 3",
            img: "https://i.pinimg.com/564x/22/b8/ae/22b8ae1cdd51a741e701d4f1b2d175fa.jpg",
            content: "Xто непосредственные участники технического прогресса ограничены исключительно образом мышления. Каждый из нас понимает очевидную вещь: перспективное планирование однозначноwertyeryse45uys46u46u8e5ue5n65u75 54y7w467 yw46  определяет каждого участника как способного принимать собственные решения касаемо стандартных подходов. Современные технологии достигли такого уровня, что синтетическое тестирование обеспечивает широкому кругу (специалистов) участие в формировании приоритизации разума над эмоциями."
        },
        {
            articleNewsId: 4,
            title: "News 4",
            img: "https://i.pinimg.com/564x/22/b8/ae/22b8ae1cdd51a741e701d4f1b2d175fa.jpg",
            content: "XXXXXXXXXXто непосредственные участники технического прогресса ограничены исключительно образом мышления. Каждый из нас понимает очевидную вещь: перспективное планирование однозначноwertyeryse45uys46u46u8e5ue5n65u75 54y7w467 yw46  определяет каждого участника как способного принимать собственные решения касаемо стандартных подходов. Современные технологии достигли такого уровня, что синтетическое тестирование обеспечивает широкому кругу (специалистов) участие в формировании приоритизации разума над эмоциями."
        }
      
    ]
     

}
export default state
let croppingText = (txtB, contStr) => { return (txtB.split(".").slice(0, contStr).join('.')) }


export { croppingText }