let state = { 
    cards: [
        {
            idCard: 1,
            cardTitlle: "Card 1",
            cardContent : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."
        },
        {
            idCard: 2,
            cardTitlle: "Card 2",
            cardContent : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."            
        },
        {
            idCard: 3,
            cardTitlle: "Card 3",
            cardContent : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."
        },
        {
            idCard: 4,
            cardTitlle: "Card 4",
            cardContent : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."            
        },
        {
            idCard: 5,
            cardTitlle: "Card 5",
            cardContent : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."
        },
        {
            idCard: 6,
            cardTitlle: "Card 6",
            cardContent : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."            
        },
        {
            idCard: 7,
            cardTitlle: "Card 7",
            cardContent : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."
        },
        {
            idCard: 8,
            cardTitlle: "Card 8",
            cardContent : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."            
        },
         {
            idCard: 9,
            cardTitlle: "Card 9",
            cardContent : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось."            
        }
        

    ],
    banners: [
        
        {
            idBanner: 1,
            hrefBanner: "#",
            srcImg: "https://sozvezdie.edu54.ru/wp-content/uploads/2020/01/CsOi_CXWgAEBqem.jpg-large.jpg",
            altImg: "Пример"       
        },
        {
            idBanner: 2,
            hrefBanner: "#",
            srcImg: "https://kkm-online.ru/tn_300x300__f_cc_ffffff_0/media_catalog_item_129/1571926044/rosobrnadzor.jimg",
            altImg: "Пример"       
        },
        {
            idBanner: 3,
            hrefBanner: "#",
            srcImg: "https://kubsu.ru/sites/default/files/insert/page/mon_logo_0.png",
            altImg: "Пример"       
        },
        {
            idBanner: 4,
            hrefBanner: "#",
            srcImg: "https://kubsu.ru/sites/default/files/insert/page/mon_logo_0.png",
            altImg: "Пример"       
        },
        {
            idBanner: 5,
            hrefBanner: "#",
            srcImg: "https://kubsu.ru/sites/default/files/insert/page/mon_logo_0.png",
            altImg: "Пример"       
        },
        {
            idBanner: 6,
            hrefBanner: "#",
            srcImg: "https://kubsu.ru/sites/default/files/insert/page/mon_logo_0.png",
            altImg: "Пример"       
        }

    ],
    articles:[
        {
            articleId: 1,
            articleTitlle: "Article 2",
            articleContent : "В целом, конечно, базовый вектор развития прекрасно подходит для реализации переосмысления внешнеэкономических политик. Прежде всего, консультация с широким активом влечет за собой процесс внедрения и модернизации благоприятных перспектив. Убеждённость некоторых оппонентов позволяет оценить значение первоочередных требований. В своём стремлении улучшить пользовательский опыт мы упускаем, что непосредственные участники технического прогресса ограничены исключительно образом мышления. Каждый из нас понимает очевидную вещь: перспективное планирование однозначноwertyeryse45uys46u46u8e5ue5n65u75 54y7w467 yw46  определяет каждого участника как способного принимать собственные решения касаемо стандартных подходов. Современные технологии достигли такого уровня, что синтетическое тестирование обеспечивает широкому кругу (специалистов) участие в формировании приоритизации разума над эмоциями."
        },
        {
            articleId: 2,
            article_titlle: "Article 2",
            article_content : "История о том, как п8uiuuu9p-08роходила студия изучения языка эсперанто, в то время, как над ней, на веранде велась студия приколистов, где травились анекдоты, и что из этого получилось.В целом, конечно, базовый вектор развития прекрасно подходит для реализации переосмысления внешнеэкономических политик. Прежде всего, консультация с широким активом влечет за собой процесс "            
        },
    ],
    NavLinks: [
        {
            idNavLink: 12,
            nameNavLink: "Пункт 12",
            hrefNavLink:
            [
                {
                    idNavLink: 22,
                    nameNavLink: "Пункт 22",
                    hrefNavLink: "#"
                   
                },
                {
                    idNavLink: 32,
                    nameNavLink: "Пункт 32",
                    hrefNavLink: "#"
                        
                },
                {
                    idNavLink: 42,
                    nameNavLink: "Пункт 42",
                    hrefNavLink: "#"
                        
                }
            ]
                   
        },
        {
            idNavLink: 2,
            nameNavLink: "Пункт 2",
            hrefNavLink: "#"
                   
        },
        {
            idNavLink: 3,
            nameNavLink: "Пункт 3",
            hrefNavLink: "#"
                   
        },
        {
            idNavLink: 4,
            nameNavLink: "Пункт 4",
            hrefNavLink: "#"
                   
        },
        {
            idNavLink: 5,
            nameNavLink: "Пункт 5",
            hrefNavLink: "#"
                   
        },
        {
            idNavLink: 5,
            nameNavLink: "Пункт 5",
            hrefNavLink: "#"
                   
        }
         
    ],
    contNews: [
        {
            articleNewsId: 1,
            articleNewsTitle: "News 1",
            articleNewsImg: "https://i.pinimg.com/564x/22/b8/ae/22b8ae1cdd51a741e701d4f1b2d175fa.jpg",
            articleNewsContent: "Xто непосредственные участники технического прогресса ограничены исключительно образом мышления. Каждый из нас понимает очевидную вещь: перспективное планирование однозначноwertyeryse45uys46u46u8e5ue5n65u75 54y7w467 yw46  определяет каждого участника как способного принимать собственные решения касаемо стандартных подходов. Современные технологии достигли такого уровня, что синтетическое тестирование обеспечивает широкому кругу (специалистов) участие в формировании приоритизации разума над эмоциями."
        },
        {
            articleNewsId: 2,
            articleNewsTitle: "News 2",
            articleNewsImg: "https://i.pinimg.com/564x/22/b8/ae/22b8ae1cdd51a741e701d4f1b2d175fa.jpg",
            articleNewsContent: "XXXXXXXXXXто непосредственные участники технического прогресса ограничены исключительно образом мышления. Каждый из нас понимает очевидную вещь: перспективное планирование однозначноwertyeryse45uys46u46u8e5ue5n65u75 54y7w467 yw46  определяет каждого участника как способного принимать собственные решения касаемо стандартных подходов. Современные технологии достигли такого уровня, что синтетическое тестирование обеспечивает широкому кругу (специалистов) участие в формировании приоритизации разума над эмоциями."
        },
        {
            articleNewsId: 3,
            articleNewsTitle: "News 3",
            articleNewsImg: "https://i.pinimg.com/564x/22/b8/ae/22b8ae1cdd51a741e701d4f1b2d175fa.jpg",
            articleNewsContent: "Xто непосредственные участники технического прогресса ограничены исключительно образом мышления. Каждый из нас понимает очевидную вещь: перспективное планирование однозначноwertyeryse45uys46u46u8e5ue5n65u75 54y7w467 yw46  определяет каждого участника как способного принимать собственные решения касаемо стандартных подходов. Современные технологии достигли такого уровня, что синтетическое тестирование обеспечивает широкому кругу (специалистов) участие в формировании приоритизации разума над эмоциями."
        },
        {
            articleNewsId: 4,
            articleNewsTitle: "News 4",
            articleNewsImg: "https://i.pinimg.com/564x/22/b8/ae/22b8ae1cdd51a741e701d4f1b2d175fa.jpg",
            articleNewsContent: "XXXXXXXXXXто непосредственные участники технического прогресса ограничены исключительно образом мышления. Каждый из нас понимает очевидную вещь: перспективное планирование однозначноwertyeryse45uys46u46u8e5ue5n65u75 54y7w467 yw46  определяет каждого участника как способного принимать собственные решения касаемо стандартных подходов. Современные технологии достигли такого уровня, что синтетическое тестирование обеспечивает широкому кругу (специалистов) участие в формировании приоритизации разума над эмоциями."
        }
      
    ]
     

}
export default state
let croppingText = (txtB, contStr) => { return (txtB.split(".").slice(0, contStr).join('.')) }


export { croppingText }